[
    {
      "course_name": "Introduction to Music Theory",
      "instructor": "Dr. Sarah Johnson",
      "duration_weeks": 10,
      "description": "Explore the fundamental concepts of music theory, including notation, scales, chords, and basic harmony. This course is suitable for beginners with no prior knowledge of music theory."
    },
    {
      "course_name": "Piano for Beginners",
      "instructor": "Prof. Michael Smith",
      "duration_weeks": 8,
      "description": "Learn the basics of playing the piano from scratch. Topics covered include hand positioning, reading sheet music, and playing simple melodies. No prior experience required."
    },
    {
      "course_name": "Guitar Masterclass: Intermediate Level",
      "instructor": "Jamie Rodriguez",
      "duration_weeks": 12,
      "description": "Take your guitar skills to the next level with this intermediate-level masterclass. Explore advanced chords, techniques, and improvisation. Prior experience with basic guitar playing required."
    },
    {
      "course_name": "Introduction to Electronic Music Production",
      "instructor": "DJ Alex Turner",
      "duration_weeks": 6,
      "description": "Dive into the world of electronic music production with this hands-on course. Learn how to use digital audio workstations (DAWs), create beats, synthesize sounds, and arrange tracks."
    },
    {
      "course_name": "Music History: Baroque to Romantic Era",
      "instructor": "Dr. Emily Clark",
      "duration_weeks": 10,
      "description": "Explore the rich history of Western classical music from the Baroque period to the Romantic era. Learn about prominent composers, musical forms, and significant works from each period."
    },
    {
      "course_name": "Songwriting Workshop",
      "instructor": "Singer-songwriter Lisa Brown",
      "duration_weeks": 8,
      "description": "Unlock your creativity and learn the art of songwriting. Explore lyric writing, melody construction, song structure, and techniques for generating ideas."
    },
    {
      "course_name": "Jazz Improvisation Techniques",
      "instructor": "Jazz musician David Lee",
      "duration_weeks": 10,
      "description": "Develop your improvisational skills in the context of jazz music. Learn essential scales, chord progressions, and soloing techniques used in jazz improvisation."
    },
    {
      "course_name": "World Music: Exploring Cultural Traditions",
      "instructor": "",
      "duration_weeks": 0,
      "description": "Instructor and duration information not available."
    }
  ]
  